In [1]:
import pandas as pd
from pathlib import Path
input_file = Path.cwd()/'a1beginners130pm.csv'

Read the dataframe, forcing the 'Phone' and 'Mobile' fields to be strings instead of int (so that 0413649692 doesn't become 413649692)

In [ ]:
df = pd.read_csv(input_file, dtype={'Phone': object,'Mobile':object})

In [2]:
df.columns

Index(['Title', 'Given', 'Surname', 'Mem_num', 'Street', 'Suburb', 'State',
       'PostC', 'Email', 'Phone', 'Mobile', 'Status', 'Paid', 'Creche',
       'Notes'],
      dtype='object')

Get rid of the fields that the teacher doesn't need

In [3]:
df.drop(['Title','Mem_num', 'Street', 'Suburb', 'State',
       'PostC', 'Status', 'Paid', 'Creche',
       'Notes'], axis=1, inplace=True)

In [4]:
df

,Given,Surname,Email,Phone,Mobile
0,Paulette,Johnston,Paulettejohnston@hotmail.com,0449997889,0449997889
1,Frances,Jones,f.jones.manacor55@gmail.com,NaN,0418934627
2,Peta,Kimpton,petakimpton@gmail.com,423939784,0423939784
3,Cheyenne l’herpiniere,L’herpiniere,cheyennelh@yahoo.com,NaN,0448300516
4,Pauline,Murphy,paulinemurphy8@gmail.com,NaN,0404701340
5,Catherine Bridget,O'Neill,bridieoneill23@gmail.com,NaN,0417170037
6,Carmen,Sum-leggatt,csumlegg@gmail.com,NaN,0414637636
7,Stephanie,Tassell,steph.tassell@westnet.com.au,+61409290057,0409290057
8,Sydney,Tong,Smtong@iinet.com.au,NaN,0402899234

Export to HTML

In [ ]:
html = df.to_html(index=False)
text_file = open("index.html", "w")
text_file.write(html)
text_file.close()